model {
  ssd {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v1_ppn"
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999999e-05
          }
        }
        initializer {
          random_normal_initializer {
            mean: 0.0
            stddev: 0.0099999998
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.97000003
          center: true
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999999e-05
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.0099999998
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.97000003
            center: true
            scale: true
            epsilon: 0.001
            train: true
          }
        }
        depth: 512
        num_layers_before_predictor: 1
        kernel_size: 1
        class_prediction_bias_init: -4.5999999
        share_prediction_tower: true
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.15000001
        max_scale: 0.94999999
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.33329999
        reduce_boxes_in_lowest_layer: false
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 9.9999999e-09
        iou_threshold: 0.60000002
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.75
        }
      }
      classification_weight: 1.0
      localization_weight: 1.5
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 32
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.69999999
          total_steps: 50000
          warmup_learning_rate: 0.13330001
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.89999998
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "gs://fire_land/data/model.ckpt"
  num_steps: 50000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  use_bfloat16: false
}
train_input_reader {
  label_map_path: "gs://fire_land/data/fire_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "gs://fire_land/data/train.record"
  }
}
eval_config {
  num_examples: 65
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "gs://fire_land/data/fire_label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  num_readers: 1
  tf_record_input_reader {
    input_path: "gs://fire_land/data/val.record"
  }
  sample_1_of_n_examples: 1
}
